Revit 2027 API
RebarShapeConstraint180DegreeBendArcLength Constructor
 Create a 180-degree bend constraint driven by arc length.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RebarShapeConstraint180DegreeBendArcLength(
	ElementId paramId
)
Public Sub New (
	paramId As ElementId
)
public:
RebarShapeConstraint180DegreeBendArcLength(
	ElementId^ paramId
)
new :
        paramId : ElementId -> RebarShapeConstraint180DegreeBendArcLength
Parameters
paramId ElementId
 The Id of a Rebar Shape parameter.
Exceptions
Exception | Condition
ArgumentException |  paramId is not a valid Element identifier.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
RebarShapeConstraint180DegreeBendArcLength Class
Autodesk.Revit.DB.Structure Namespace